
IDENTIFICATION DIVISION.
PROGRAM-ID. AOCDAY4.

ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
        FILE-CONTROL.
        SELECT INPUTT ASSIGN TO 'input.txt'
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
    FILE SECTION.
    FD INPUTT.
        01 AOC-LINE.
            05 A-NUM PIC A(11).

    WORKING-STORAGE SECTION.
        01 WS-AOC-TALLY PIC 9(4).
        01 WS-AOC-LINE PIC A(11).
        01 WS-AOC-NUM-A PIC 9(2).
        01 WS-AOC-NUM-B PIC 9(2).
        01 WS-AOC-NUM-C PIC 9(2).
        01 WS-AOC-NUM-D PIC 9(2).

        01 WS-EOF-FLAG PIC A(01).

PROCEDURE DIVISION.
    OPEN INPUT INPUTT.
        PERFORM UNTIL WS-EOF-FLAG='Y'
            READ INPUTT INTO WS-AOC-LINE
                AT END MOVE 'Y' TO WS-EOF-FLAG
                NOT AT END
                    UNSTRING WS-AOC-LINE DELIMITED BY '-' OR ',' INTO
                    WS-AOC-NUM-A WS-AOC-NUM-B WS-AOC-NUM-C WS-AOC-NUM-D

                    IF WS-AOC-NUM-A < WS-AOC-NUM-C AND WS-AOC-NUM-B > WS-AOC-NUM-D THEN ADD 1 TO WS-AOC-TALLY END-IF
                    IF WS-AOC-NUM-C < WS-AOC-NUM-A AND WS-AOC-NUM-D > WS-AOC-NUM-B THEN ADD 1 TO WS-AOC-TALLY END-IF
                    IF WS-AOC-NUM-C = WS-AOC-NUM-A AND WS-AOC-NUM-D = WS-AOC-NUM-B THEN ADD 1 TO WS-AOC-TALLY END-IF
                    IF WS-AOC-NUM-A = WS-AOC-NUM-C AND WS-AOC-NUM-B > WS-AOC-NUM-D THEN ADD 1 TO WS-AOC-TALLY END-IF
                    IF WS-AOC-NUM-A < WS-AOC-NUM-C AND WS-AOC-NUM-B = WS-AOC-NUM-D THEN ADD 1 TO WS-AOC-TALLY END-IF
                    IF WS-AOC-NUM-C = WS-AOC-NUM-A AND WS-AOC-NUM-D > WS-AOC-NUM-B THEN ADD 1 TO WS-AOC-TALLY END-IF
                    IF WS-AOC-NUM-C < WS-AOC-NUM-A AND WS-AOC-NUM-D = WS-AOC-NUM-B THEN ADD 1 TO WS-AOC-TALLY END-IF

                    DISPLAY WS-AOC-NUM-A '-' WS-AOC-NUM-B '|' WS-AOC-NUM-C '-' WS-AOC-NUM-D '=' WS-AOC-TALLY
            END-READ
        END-PERFORM.
    CLOSE INPUTT.
STOP RUN.
